# 11.120 В массиве находится информация о росте 35 человек. Определить сколько человек имеют самый большой рост?
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# someLength = 35
# index = 0
# maxLength = 0
# length = []
# count = 0
# while index < someLength:
#     length.append(int(input()))
#     if length[index] > maxLength:
#         maxLength = length[index]
#     index += 1
# index = 0
# while index < someLength:
#     if length[index] == maxLength:
#         count += 1
#     index += 1
# print(count)
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# 11.132 Дан массив. Определить:
# Максимальный элемент массива и элемент, являющийся максимальным без учета этого элемента.
# Минимальный элемент массива и элемент, являющийся минимальным без учета этого элемента.
# Номера максимального элемента массива и элемента, являющегося максимальным без учета этого элемента.
# Номера минимального элемента массива и элемента, являющегося минимальным без учета этого элемента.
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# someList = [0, 12, 23, 43, 45, 56, 76, 87, 98, 109, 0, 11, 12, 13, 14, 15, 16, 17, 18, 19, 0, 91, 72, 63, 84, 65, 56,
#             27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 0]
# index = 0
# maxElement = 0  # Максимальный элемент массива
# minElement = 0  # Минимальный элемент массива
# maxIndex = 0  # Номера максимального элемента массива
# minIndex = 0  # Номера минимального элемента массива
# while index < len(someList):
#     if someList[index] > maxElement:
#         maxElement = someList[index]
#         maxIndex = index
#     if someList[index] < minElement:
#         minElement = someList[index]
#         minIndex = index
#     index += 1
# print(maxElement, maxIndex)
# print(minElement, minIndex)
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# 11.145 Дан массив из четного числа элементов. Поменять местами:
# Его половины.
# Первый элемент со вторым, третий - с четвертым и т.д.
# Его половины следующим способом: первый элемент поменять с последним, второй - с предпоследним и т.д.
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# someList = [0, 12, 23, 43, 45, 56, 76, 87, 98, 109, 0, 11, 12, 13, 14, 15, 16, 17, 18, 19, 0, 91, 72, 63, 84, 65, 56,
#             27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 0]
# someIndex = 0
# someList1 = []
# someList2 = []
# index = 0
# index1 = len(someList) // 2
# while index1 < len(someList):
#     someList1.append(someList[index1])
#     index1 += 1
# index1 = len(someList) // 2
# while index < index1:
#     someList1.append(someList[index])
#     index += 1
# index = 1
# print(someList1)
# while index < len(someList):
#     someIndex = someList[index - 1]
#     someList[index - 1] = someList[index]
#     someList[index] = someIndex
#     index += 2
# print(someList)
# someList2 = someList[:len(someList) // 2:-1] + someList[len(someList) // 2::-1]
# print(someList2)
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# 11.173 Переставить последний элемент массива на место первого. При этом первый, второй,..., предпоследний элементы
# сдвинуть в право на 1 позицию.
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# someList = [0, 12, 23, 43, 45, 56, 76, 87, 98, 109, 0, 11, 12, 13, 14, 15, 16, 17, 18, 19, 0, 91, 72, 63, 84, 65, 56,
#             27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 0]
# index = 1
# someList.insert(someList[-1], 0)
# someList.pop(-1)
# print(someList)
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
